{
"facts": [
    "Hermione's parents are both Muggles - and both dentists.",
    "Harry is often told he has the green eyes of his mother and the messy hair and personality of his father.",
    "Ron is the youngest son of the Weasley family - second youngest overall to his sister Ginny.",
    "Draco, his mother and father all live together in a huge building called Malfoy Manor. Yep, they're rich.",
    "Neville was once pushed off Blackpool pier by his great-uncle Algie to 'force some magic' out of him.",
    "There truly might not be an interesting thing to say about Crabbe & Goyle. They seem to exist to just follow Malfoy around.",
    "Percy has an owl, Hermes, bought for him by his parents for becoming a Prefect.",
    "Professor McGonagall is an Animagus, meaning she can turn into a cat. She even has spectacle-shaped markings around her eyes when she is a cat.",
    "Teaching Potions was not Snape's first choice - he has applied for the post of Defence Against the Dark Arts professor many times...",
    "Professor Sprout's preferred type of fertiliser is dragon dung! Each to their own!",
    "Hedwig is named after someone Harry reads about in his textbook, A History of Magic.",
    "To hatch a dragon egg, you must keep it in a fire - because dragons' mums like to breathe on their eggs.",
    "Fang is just an ordinary dog - but that doesn't make him any less interesting.",
    "The Hogwarts motto 'Draco Dormiens Nunquam Titillandus' means 'Never Tickle a Sleeping Dragon.",
    "The Great Hall ceiling is bewitched to reflect the sky outside.",
    "The Sorting Hat used to be a regular hat owned by Godric Gryffindor.",
    "There are over a hundred portraits in the Hogwarts castle, and the inhabitants can visit each other's paintings.",
    "The Hogwarts kitchens are located directly below the Great Hall and are accessed by tickling a pear on a fruit bowl painting.",
    "Peeves the Poltergeist has been at Hogwarts for centuries, causing chaos for teachers and students alike.",
    "Dumbledore's full name is Albus Percival Wulfric Brian Dumbledore — quite a mouthful for the greatest wizard of his time!"
]
}